#### BuiltInFailures.DividedPathFailures Members

---

|  |
| --- |
| BuiltInFailures DividedPathFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DividedPathFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | DividedPathCannotApplyDivideSettings | Default Divide settings cannot be applied to Divided Path. |
| Public property Static member | DividedPathCannotBeMirroredWithoutItsCurves | Divided path cannot be mirrored without its curves. |
| Public property Static member | DividedPathCannotCreateFromGeometry | Highlighted geometry contains a path or edge that could not be divided. |
| Public property Static member | DividedPathDistanceTooSmall | Distance is too small. |
| Public property Static member | DividedPathIndentsOverlap | Beginning indent and end indent overlap. |
| Public property Static member | DividedPathIntersectionPolycurveParamsStepFailed | Intersection failed. |
| Public property Static member | DividedPathInvalidNumberOfPoints | End indent is too large. |
| Public property Static member | DividedPathLayoutStepFailed | Layout algorithm failed. |
| Public property Static member | DividedPathUpdateMergedPointKeysStepFailed | Merging failed. |

# See Also

BuiltInFailures DividedPathFailures Class

Autodesk.Revit.DB Namespace